
// Swap two numbers

#include <iostream>

/*

Задача с временной переменной.

- что такое своппинг?
- в чем проявляется обмен? в смене индексов? значений переменных? самих переменных? указателей? ссылок?

1. Объявлю три переменные, одна из них временная. 
Алгоритм своппинга основан на операторе присваивания, т.е. воспользуюсь определением процедурного языка.

    - ага, доп пункт - решение на основе определения языка.
    - это и не алгоритм толком.
    - это вопрос присваиваиния, уровня 2, уровня операторов.
    - но на основе этого можно написать отдельную функцию.
    -- и как это кластеризовать?
    -- подожди!

2. 


*/



int main() {

    int var1;
    int temp_var;
    int var2;

    var1 = temp_var;
    temp_var = var2;
    var2 = var1;

/*

1. Преимущества и недостатки подхода?
2. Стратегии улучшения по уровням и по пунктам?

    - со стороны алгоритма (с доп переменной, без доп переменной)
        - а насколько мне понятен этот алгоритм? настолько же, насколько и оператор присваиваивания (ЕГО ОСНОВА).
    - со стороны оператора присваивания 
    - со стороны языка (move, указатели, переменные, ссылки)
        - настолько же смогу улучшить, насколько понимаю перечисленные мною компоненты
    
    
    - со стороны компактности, записи
        - это шелуховенько, если не понимаешь базу.
    - со стороны функций и модульности
        - ровно так и это шелуха, как шелуха компактность. во главе всего алгоритм.


*/

}
